{
  "situacao_do_banco": [
    {
      "id": 1,
      "tipo_sanguineo": "A+",
      "porcentagem": 50
    },
    {
      "id": 2,
      "tipo_sanguineo": "A-",
      "porcentagem": 80
    },
    {
      "id": 3,
      "tipo_sanguineo": "B+",
      "porcentagem": 60
    },
    {
      "id": 4,
      "tipo_sanguineo": "B-",
      "porcentagem": 35
    },
    {
      "id": 5,
      "tipo_sanguineo": "AB+",
      "porcentagem": 20
    },
    {
      "id": 6,
      "tipo_sanguineo": "AB-",
      "porcentagem": 40
    },
    {
      "id": 7,
      "tipo_sanguineo": "O+",
      "porcentagem": 50
    },
    {
      "id": 8,
      "tipo_sanguineo": "O-",
      "porcentagem": 20
    }
  ],
  "centros_de_doacao": [
    {
      "id": 1,
      "nome": "Fundação Hemocentro de Brasília",
      "link_localizacao": "https://maps.app.goo.gl/mewFKhGsWWCap3a79",
      "endereco": "BL 3 - SMHN conjunto A - Asa Norte, Brasília - DF, 70710-908",
      "telefone": "06133274413"
    },
    {
      "id": 2,
      "nome": "Hospital Regional de Taguatinga",
      "link_localizacao": "https://maps.app.goo.gl/HkNADd2iTSjNRttH7",
      "endereco": "St. C Norte Área Especial 24 - Taguatinga, Brasília - DF, 72115-902",
      "telefone": "06120171700"
    },
    {
      "id": 3,
      "nome": "Hospital de Base do DF",
      "link_localizacao": "https://maps.app.goo.gl/fkPUr4aWH3iDP7gx7",
      "endereco": "SNO Q 1 - Pte. Alta Norte (Gama), Brasília - DF",
      "telefone": "061982777211"
    },
    {
      "id": 4,
      "nome": "Hospital Regional de Guará",
      "link_localizacao": "https://maps.app.goo.gl/eJTM7r8mCfySXjRc8",
      "endereco": "QI O6, Lote C s/n, Área Especial, Brasília - DF, 71010-006",
      "telefone": "06133274413"
    }
  ],
  "artigos": [
    {
      "id": 1,
      "titulo": "O que é doação de sangue?",
      "conteudo": "## O que é doação de sangue?\\n\\nA doação de sangue é um ato voluntário que consiste em disponibilizar uma pequena quantidade do próprio sangue para ajudar outras pessoas que necessitam de transfusões. É um gesto de solidariedade que pode salvar vidas em situações de emergência, cirurgias complexas, tratamentos de doenças crônicas e outras condições médicas graves. O sangue humano é insubstituível, ou seja, não pode ser fabricado artificialmente, tornando as doações essenciais para manter os estoques dos bancos de sangue.\\n\\n## Importância da doação de sangue\\n\\nO sangue é um recurso vital que desempenha funções cruciais no organismo, como o transporte de oxigênio e nutrientes para as células e a defesa contra infecções. Hospitais e clínicas dependem de um suprimento constante de sangue para atender a pacientes em estado crítico. A falta de sangue disponível pode levar a atrasos em procedimentos médicos e, em casos extremos, à perda de vidas. Doar sangue regularmente ajuda a garantir que haja estoque suficiente para atender a demanda, especialmente em períodos de maior necessidade, como durante pandemias ou desastres naturais.\\n\\n## Quem pode doar?\\n\\nA maioria das pessoas em boas condições de saúde pode ser um doador de sangue. Os critérios básicos incluem ter entre 16 e 69 anos (menores de 18 anos precisam de consentimento dos responsáveis), pesar no mínimo 50 kg e estar em bom estado de saúde. É importante que o doador não esteja em jejum e tenha dormido pelo menos 6 horas na noite anterior. Alguns impedimentos temporários incluem sintomas de gripe ou resfriado, gravidez, pós-operatório recente e consumo de bebidas alcoólicas nas últimas 12 horas. Impedimentos definitivos podem envolver doenças transmissíveis pelo sangue, como hepatites B e C, HIV/AIDS, doenças de Chagas e malária.\\n\\n## Como é o processo de doação?\\n\\nO processo de doação de sangue é simples, seguro e dura cerca de 40 minutos. Inicia-se com um cadastro, onde são coletados dados pessoais. Em seguida, o doador passa por uma triagem clínica confidencial, na qual um profissional de saúde faz perguntas sobre o estado de saúde e hábitos de vida para garantir a segurança tanto do doador quanto do receptor. Após a aprovação na triagem, é realizada a coleta de aproximadamente 450 ml de sangue, utilizando materiais descartáveis e esterilizados para eliminar qualquer risco de contaminação. Após a doação, o doador recebe orientações sobre cuidados posteriores, como ingerir bastante líquido e evitar esforços físicos intensos nas próximas horas.\\n\\n## Benefícios da doação\\n\\nAlém de ajudar a salvar vidas, a doação de sangue traz benefícios para o próprio doador. O ato estimula o organismo a renovar as células sanguíneas, contribuindo para a manutenção de uma boa saúde. Durante o processo, o doador também passa por uma miniavaliação médica gratuita, que pode auxiliar na detecção precoce de possíveis problemas de saúde. Psicologicamente, a doação promove sentimentos positivos, como satisfação pessoal e empatia, fortalecendo o senso de comunidade e responsabilidade social.\\n\\n## Mitos e verdades\\n\\nExistem muitos mitos relacionados à doação de sangue que podem desencorajar potenciais doadores. Alguns acreditam que doar sangue engorda ou afina o sangue, o que não é verdade. Outros temem contrair doenças durante a doação, porém todos os materiais utilizados são descartáveis e seguem rígidos padrões de segurança. Também é mito que pessoas com tatuagens não podem doar; na realidade, elas podem doar após um período de 12 meses da realização da tatuagem. Esclarecer essas dúvidas é fundamental para aumentar o número de doadores e garantir estoques adequados nos bancos de sangue.\\n\\n## Como se preparar para doar\\n\\nPara uma experiência de doação tranquila, é recomendável que o doador esteja bem alimentado, evitando comidas gordurosas nas 3 horas que antecedem a doação. É importante estar descansado, tendo dormido pelo menos 6 horas na noite anterior. Deve-se evitar o consumo de bebidas alcoólicas nas últimas 12 horas e não fumar por pelo menos 2 horas antes e depois da doação. Levar um documento oficial com foto é indispensável para o cadastro. Caso esteja tomando algum medicamento ou tenha passado por procedimentos médicos recentes, informe o profissional de saúde durante a triagem.\\n\\n## Conclusão\\n\\nA doação de sangue é um ato de amor ao próximo que pode fazer a diferença entre a vida e a morte para muitas pessoas. Ao dedicar um pouco do seu tempo e disposição, você contribui significativamente para a saúde pública e o bem-estar da comunidade. Informar-se, desmistificar preconceitos e compartilhar esse conhecimento com amigos e familiares pode amplificar o impacto positivo dessa ação. Procure o hemocentro mais próximo e faça parte dessa corrente de solidariedade.",
      "resumo": "A doação de sangue é um gesto solidário de doar uma pequena quantidade do próprio sangue para salvar a vida de pessoas que necessitam de transfusão sanguínea.",
      "url_imagem": "https://images.unsplash.com/photo-1615461066159-fea0960485d5?q=80&w=2032&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "desc_imagem": "Imagem de uma pessoa doando sangue."
    },
    {
      "id": 2,
      "titulo": "Quem pode doar sangue?",
      "conteudo": "## Quem pode doar sangue?\\n\\nA doação de sangue é um ato solidário que salva vidas, mas para garantir a segurança de quem doa e de quem recebe, existem critérios específicos que determinam quem está apto a doar.\\n\\n## Requisitos básicos\\n\\nPara ser um doador de sangue, é necessário atender aos seguintes requisitos:\\n\\n- **Idade:** ter entre 16 e 69 anos. Doadores com 16 e 17 anos precisam de consentimento formal dos responsáveis legais.\\n- **Peso:** pesar no mínimo 50 kg.\\n- **Estado de saúde:** estar em boas condições de saúde no momento da doação.\\n- **Alimentação:** estar alimentado, evitando comidas gordurosas nas 3 horas que antecedem a doação.\\n- **Documento:** apresentar um documento oficial com foto, como RG, CNH ou passaporte.\\n\\n## Restrições temporárias\\n\\nAlgumas condições impedem a doação de sangue por um período determinado:\\n\\n- **Gripe ou resfriado:** aguardar 7 dias após o desaparecimento dos sintomas.\\n- **Gravidez e amamentação:** mulheres grávidas ou amamentando não podem doar. Após o parto, aguardar 90 dias (parto normal) ou 180 dias (cesariana).\\n- **Tatuagens e piercings:** aguardar 12 meses após a realização. Piercings em região oral ou genital impedem a doação enquanto estiverem no local.\\n- **Vacinas:** o período de impedimento varia conforme o tipo de vacina.\\n- **Cirurgias e procedimentos invasivos:** o tempo de inaptidão varia de 3 meses a 1 ano, dependendo do procedimento.\\n\\n## Restrições definitivas\\n\\nAlgumas condições impedem a doação de sangue de forma permanente:\\n\\n- **Doenças transmissíveis pelo sangue:** como hepatites B e C, HIV/AIDS, HTLV I/II, doença de Chagas e sífilis.\\n- **Uso de drogas ilícitas injetáveis.**\\n- **Malária:** histórico de malária impede a doação.\\n- **Doenças hematológicas graves:** como anemia falciforme.\\n\\n## Importância da honestidade na triagem\\n\\nDurante a entrevista de triagem, é fundamental responder às perguntas com sinceridade. As informações coletadas são confidenciais e visam proteger a saúde do doador e do receptor.\\n\\n## Consultar o hemocentro\\n\\nEm caso de dúvidas sobre a elegibilidade para doar sangue, entre em contato com o hemocentro ou banco de sangue mais próximo. Profissionais capacitados poderão fornecer orientações específicas para cada situação.",
      "resumo": "Requisitos básicos para doar sangue incluem estar saudável, ter entre 16 e 69 anos e pesar pelo menos 50 kg.",
      "url_imagem": "https://plus.unsplash.com/premium_photo-1682309704250-6bac0f499665?q=80&w=2112&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "desc_imagem": "Imagem de um centro de doação de sangue."
    },
    {
      "id": 3,
      "titulo": "Benefícios da doação de sangue",
      "conteudo": "## Benefícios da doação de sangue\\n\\nA doação de sangue é um gesto altruísta que não apenas salva vidas, mas também traz vários benefícios para a saúde física e mental do doador.\\n\\n## Renovação sanguínea\\n\\nAo doar sangue, o organismo é estimulado a produzir novas células sanguíneas. Esse processo de renovação ajuda a manter o sangue saudável e pode melhorar a circulação.\\n\\n## Monitoramento da saúde\\n\\nAntes da doação, o doador passa por uma avaliação médica que inclui:\\n\\n- **Verificação dos sinais vitais:** pressão arterial, pulso e temperatura corporal.\\n- **Testes de anemia:** para garantir que os níveis de hemoglobina estão adequados.\\n- **Exames laboratoriais:** após a doação, o sangue é testado para doenças como hepatites B e C, HIV, sífilis e doença de Chagas.\\n\\nEssa triagem funciona como um check-up gratuito, permitindo a detecção precoce de possíveis problemas de saúde.\\n\\n## Redução de risco cardiovascular\\n\\nAlgumas pesquisas sugerem que a doação regular de sangue pode reduzir o risco de doenças cardíacas, especialmente em homens, ao diminuir o excesso de ferro no organismo, que pode causar oxidação do colesterol e danificar as artérias.\\n\\n## Bem-estar psicológico\\n\\nAjudar outras pessoas promove sentimentos positivos, como satisfação pessoal e senso de propósito. Atos de altruísmo estão associados à redução do estresse e melhora do estado emocional.\\n\\n## Impacto social\\n\\nCada doação pode salvar até quatro vidas. Ao doar sangue, você contribui para a sociedade, ajudando pacientes em cirurgias, vítimas de acidentes, pessoas com doenças crônicas e outras condições que requerem transfusões sanguíneas.\\n\\n## Incentivo a hábitos saudáveis\\n\\nPara manter-se apto a doar, o doador é incentivado a adotar um estilo de vida saudável, incluindo alimentação balanceada, prática regular de exercícios e abstinência de substâncias nocivas, como tabaco e drogas ilícitas.",
      "resumo": "A doação de sangue ajuda a renovar as células sanguíneas e proporciona um check-up gratuito ao doador.",
      "url_imagem": "https://plus.unsplash.com/premium_photo-1682090362426-843159e3bb9d?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "desc_imagem": "Imagem de uma equipe médica realizando exames."
    },
    {
      "id": 4,
      "titulo": "Cuidados após a doação de sangue",
      "conteudo": "## Cuidados após a doação de sangue\\n\\nApós doar sangue, é essencial seguir algumas recomendações para garantir o bem-estar e a recuperação adequada do organismo.\\n\\n## Repouso imediato\\n\\n- **Permanência no local:** fique no banco de sangue por pelo menos 15 minutos após a doação para observação.\\n- **Alimentação leve:** aproveite o lanche oferecido para repor as energias e manter os níveis de açúcar no sangue estáveis.\\n\\n## Hidratação\\n\\n- **Aumente a ingestão de líquidos:** beba bastante água, sucos naturais ou chás nas próximas 24 horas para ajudar na reposição do volume sanguíneo.\\n- **Evite álcool:** não consuma bebidas alcoólicas por pelo menos 12 horas, pois podem causar desidratação e intensificar possíveis tonturas.\\n\\n## Atividades físicas\\n\\n- **Evite exercícios intensos:** não pratique esportes ou atividades físicas pesadas nas próximas 12 a 24 horas para prevenir mal-estar ou desmaios.\\n- **Retorne gradualmente:** volte às atividades físicas de forma progressiva, respeitando os sinais do seu corpo.\\n\\n## Cuidados com o local da punção\\n\\n- **Mantenha o curativo por pelo menos 4 horas:** isso ajuda a evitar sangramentos e infecções.\\n- **Não carregue peso com o braço utilizado na doação:** previne sangramentos e hematomas.\\n- **Em caso de sangramento:** pressione o local com algodão ou gaze limpa até parar.\\n\\n## Alimentação\\n\\n- **Refeições balanceadas:** consuma alimentos ricos em ferro e vitamina C, como carnes magras, feijões, vegetais de folhas escuras e frutas cítricas, para auxiliar na recuperação dos glóbulos vermelhos.\\n- **Evite alimentos gordurosos:** podem causar desconforto digestivo e não contribuem para a recuperação.\\n\\n## Sintomas a observar\\n\\n- **Tonturas ou fraqueza:** sente-se ou deite-se imediatamente até a sensação passar.\\n- **Hematomas ou inchaço no local da punção:** aplique uma compressa fria nas primeiras 12 horas e morna após esse período.\\n- **Persistência dos sintomas:** se qualquer desconforto continuar, entre em contato com o banco de sangue ou procure atendimento médico.\\n\\nSeguindo essas orientações, o doador garante uma recuperação tranquila e está pronto para futuras doações, contribuindo continuamente para salvar vidas.",
      "resumo": "Após a doação, evite atividades físicas intensas e mantenha-se hidratado para ajudar na recuperação do corpo.",
      "url_imagem": "https://plus.unsplash.com/premium_photo-1670426502021-a1d1b7b1aaed?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "desc_imagem": "Imagem de uma pessoa se hidratando após a doação de sangue."
    },
    {
      "id": 5,
      "titulo": "Mitos sobre a doação de sangue",
      "conteudo": "## Mitos sobre a doação de sangue\\n\\nApesar de sua importância, a doação de sangue ainda é cercada por mitos e desinformações que podem afastar potenciais doadores. Vamos desmistificar algumas dessas crenças.\\n\\n## Mito 1: Doar sangue dói muito\\n\\n**Realidade:** O desconforto é mínimo, semelhante a uma picada de agulha comum. O procedimento é realizado por profissionais treinados, garantindo o máximo de conforto ao doador.\\n\\n## Mito 2: Posso contrair doenças durante a doação\\n\\n**Realidade:** Todo o material utilizado é estéril e descartável, eliminando qualquer risco de contaminação. Os bancos de sangue seguem protocolos rigorosos de higiene e segurança.\\n\\n## Mito 3: Doar sangue engorda ou emagrece\\n\\n**Realidade:** A doação de sangue não afeta o peso corporal. Não há qualquer relação entre a quantidade de sangue doada e o ganho ou perda de peso.\\n\\n## Mito 4: Pessoas com tatuagens ou piercings não podem doar\\n\\n**Realidade:** Pessoas com tatuagens e piercings podem doar sangue. É necessário aguardar 12 meses após a realização para garantir a segurança do sangue doado.\\n\\n## Mito 5: Idosos não podem doar sangue\\n\\n**Realidade:** Pessoas com até 69 anos podem doar sangue, desde que estejam em boas condições de saúde. Doadores acima de 60 anos devem ter realizado pelo menos uma doação antes dos 60.\\n\\n## Mito 6: Doar sangue afina ou engrossa o sangue\\n\\n**Realidade:** A doação não altera a viscosidade do sangue. O organismo repõe o volume e os componentes sanguíneos naturalmente, mantendo o equilíbrio.\\n\\n## Mito 7: Mulheres não podem doar durante a menstruação\\n\\n**Realidade:** A menstruação não impede a doação, desde que a mulher se sinta bem e não esteja com anemia.\\n\\n## Importância da informação\\n\\nBuscar informações em fontes confiáveis é essencial. Ao desmistificar esses mitos, mais pessoas podem se sentir seguras para doar, aumentando os estoques de sangue e salvando vidas. Se tiver dúvidas, consulte um profissional de saúde ou o hemocentro mais próximo.",
      "resumo": "Desfazendo mitos sobre a doação de sangue, como a ideia errada de que doar causa fraqueza ou pode transmitir doenças.",
      "url_imagem": "https://images.unsplash.com/photo-1593642532744-d377ab507dc8?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwzNzU2OXwwfDF8c2VhcmNofDF8fGhlYWx0aHxlbnwwfHx8fDE2MzI3NDgwODc&ixlib=rb-1.2.1&q=80&w=400",
      "desc_imagem": "Imagem ilustrativa desmistificando a doação de sangue."
    }
  ],
  "cadastro_usuarios": [
    {
      "id": "4ee5",
      "email": "abpaschoal5@gmail.com",
      "rg": "19470111",
      "peso": "62",
      "dataNascimento": "2003-06-27",
      "cep": "71980116",
      "senha": "senha123",
      "confirmaSenha": "senha123",
      "cpf": "12625069646",
      "telefone": "61996270807",
      "endereco": "rua 36 sul, Águas Claras",
      "doencaTransmissivel": "Não",
      "sexo": "Feminino"
    },
    {
      "id": "5ddc",
      "email": "analu@gmail.com",
      "rg": "12345678",
      "peso": "57",
      "dataNascimento": "2003-06-27",
      "cep": "09678099",
      "senha": "123senha",
      "confirmaSenha": "123senha",
      "cpf": "09845634872",
      "telefone": "61996270807",
      "endereco": "rua 36 sul, Águas Claras",
      "doencaTransmissivel": "Não",
      "sexo": "Feminino"
    }
  ]
}